T1rouvaille/RA2E1_IBOX/src/menu.c
/*
 * menu.c — ABS Protocol Bootloader for RA2E1
 *
 * 协议行为与 Honcho PR3 IBOX protocol 对齐:
 *   - HANDSHAKE ('B'):  回显 'B'
 *   - IDENTIFY  ('I'):  发送 'I' + 0x04 + 0x45 + ETX (4 bytes)
 *   - SET_ADDRESS ('D'): 先回显 'D', 再收 2 字节地址, 最后发 ETX
 *   - READ_FLASH ('N'):  不读任何字节, 根据已存地址响应:
 *         addr=0xFFFF → 版本信息 (88 bytes Honcho 格式)
 *         addr=0xFFFE → 校准响应
 *         其他        → 回显 'N'
 *   - READ_EEPROM ('F'): 不读任何字节, 根据已存地址响应:
 *         addr=0xFFFF → 发送 EEPROM 数据
 *         其他        → 仅发 ETX
 *   - CHANGE_BAUD ('*'): 回显 '*', 切高速波特率
 *
 * Bootloader 特有命令 (Honcho 未实现, RA2E1 保留):
 *   - LOAD_FLASH   ('M'): 写入 Flash 页面, 含 auto-erase
 *   - LOAD_EEPROM  ('E'): 写入 EEPROM 数据
 *
 * Flash page size : 512 bytes
 * Erase block size: 2048 bytes (RA2E1 Code Flash minimum erase unit)
 * Baud rate       : 9600 (slow), 28800 (fast)
 *
 * APP area  : 0x00004000 - 0x0001FFFF  (112 KB)
 */

#include "menu.h"
#include "header.h"
#include "comms/comms.h"
#include "crc16.h"
#include "hal_data.h"
#include <string.h>
#include <stdio.h>

/* ------------------------------------------------------------------ */
/*  boot_rsp — mirrors definition in bl2_main.c                        */
/* ------------------------------------------------------------------ */
struct image_header;   /* opaque, not needed in this file */

struct boot_rsp {
    const struct image_header *br_hdr;
    uint8_t  br_flash_dev_id;
    uint32_t br_image_off;
};

/* ------------------------------------------------------------------ */
/*  Constants                                                           */
/* ------------------------------------------------------------------ */
#define RX_TIMEOUT_MS       245U
#define NAK                 0x15U

/* Module ID — Honcho PR3 format (8 bytes × 2) */
static const uint8_t g_module_id[BYTES_MODULE_ID]        = MODULE_ID_FIRST;
static const uint8_t g_module_id_second[BYTES_MODULE_ID] = MODULE_ID_SECOND;

/* Honcho PR3 personalization strings */
static const char g_tool_part_number[BYTES_PART_NUMBER]    = G_TOOL_PART_NUMBER;
static const char g_personalization[BYTES_PERSONALIZATION] = G_PERSONALIZATION;

/* ------------------------------------------------------------------ */
/*  Module state                                                        */
/* ------------------------------------------------------------------ */
static uint32_t g_target_addr = APP_IMAGE_START_ADDRESS;
static uint32_t g_target_offset = 0U;
static uint8_t  g_addr_high     = 0U;
static uint8_t  g_addr_low      = 0U;
static uint8_t  g_FEE_Buffer[FEE_SIZE];
static uint8_t  g_read_eeprom   = 0U;

/* ------------------------------------------------------------------ */
/*  Forward declarations                                                */
/* ------------------------------------------------------------------ */
extern void do_boot(struct boot_rsp *rsp);

static void send_nak(void);
static fsp_err_t recv_byte(uint8_t *out);
static uint16_t checksum16(const uint8_t *buf, uint16_t len);
static bool addr_in_app_range(uint32_t addr, uint32_t len);
static fsp_err_t erase_block_if_needed(uint32_t addr);

static void cmd_handshake(void);
static void cmd_identify(void);
static void cmd_read_eeprom(void);
static void cmd_load_eeprom(void);
static void cmd_read_flash(void);
static void cmd_read_version_info(void);
static void cmd_calibration(void);
static void cmd_load_flash(void);
static void cmd_set_address(void);
static void cmd_change_baud(void);
static void try_boot(void);

/* EEPROM Bank management */
static void FEE_Read(void);
static void FEE_Write(void);
static void Get_Bank_Final_State(uint8_t* state);
static void Increment_EEP_Buffer(const uint8_t bytes, const uint8_t increment);

/* ------------------------------------------------------------------ */
/*  Simple hex print helpers (replaces snprintf for %X/%lX)            */
/* ------------------------------------------------------------------ */

/* Write a single hex nibble into buf, return pointer after it */
static uint8_t * put_nibble(uint8_t *p, uint8_t v)
{
    v &= 0x0FU;
    *p = (uint8_t)(v < 10U ? ('0' + v) : ('A' + v - 10U));
    return p + 1U;
}

/* Write 2-digit hex (uint8) */
static uint8_t * put_hex8(uint8_t *p, uint8_t v)
{
    p = put_nibble(p, (uint8_t)(v >> 4U));
    p = put_nibble(p, v);
    return p;
}

/* Write 4-digit hex (uint16) */
static uint8_t * put_hex16(uint8_t *p, uint16_t v)
{
    p = put_hex8(p, (uint8_t)(v >> 8U));
    p = put_hex8(p, (uint8_t)(v & 0xFFU));
    return p;
}

/* Write 8-digit hex (uint32) */
static uint8_t * put_hex32(uint8_t *p, uint32_t v)
{
    p = put_hex16(p, (uint16_t)(v >> 16U));
    p = put_hex16(p, (uint16_t)(v & 0xFFFFU));
    return p;
}

/* Write a literal string, return pointer after it */
static uint8_t * put_str(uint8_t *p, const char *s)
{
    while (*s) { *p++ = (uint8_t)*s++; }
    return p;
}

/* ================================================================== */
/*  Public entry point                                                  */
/* ================================================================== */
void menu(void)
{
    uint8_t cmd;
    fsp_err_t err;

    comms_send((uint8_t *)"\r\n[BL v2.1] ABS ready\r\n", 23U);

    while (1)
    {
        /* Read EEPROM on first handshake */
        if (g_read_eeprom == 1U)
        {
            FEE_Read();
            g_read_eeprom = 2U;
        }

        err = recv_byte(&cmd);

        if (err != FSP_SUCCESS)
        {
            /* Timeout: try to boot existing APP if valid */
            try_boot();
            comms_send((uint8_t *)"[BL] No valid APP, waiting...\r\n", 31U);
            continue;
        }

        switch (cmd)
        {
            case COMMAND_HANDSHAKE:     cmd_handshake();     break;
            case COMMAND_IDENTIFY:      cmd_identify();      break;
            case COMMAND_READ_EEPROM:   cmd_read_eeprom();   break;
            case COMMAND_LOAD_EEPROM:   cmd_load_eeprom();   break;
            case COMMAND_READ_FLASH:    cmd_read_flash();    break;
            case COMMAND_LOAD_FLASH:    cmd_load_flash();    break;
            case COMMAND_SET_ADDRESS:   cmd_set_address();   break;
            case COMMAND_CHANGE_BAUD:   cmd_change_baud();  break;
            case COMMAND_NACK:          try_boot();          break;  /* Exit and boot */

            default:
                send_nak();
                break;
        }
    }
}

