T1rouvaille/RA2E1_IBOX/src/menu.c
/*
 * 'F' READ_EEPROM — Honcho PR3 format
 *
 * Honcho IBOX(): 不读取任何字节, 根据已存地址响应:
 *   addr=0xFFFF → DL_Send_Read_EEPROM_Msg()   // 发送 log 数据
 *   other       → uart_tx_bit_bang(ETX)       // 仅发 ETX
 */
static void cmd_read_eeprom(void)
{
    if (g_addr_high == 0xFFU && g_addr_low == 0xFFU)
    {
        /* addr = 0xFFFF → 发送 EEPROM (FEE) 数据 */
        uint8_t rsp[FEE_SIZE + 4];
        uint16_t i;

        rsp[0] = COMMAND_READ_EEPROM;
        rsp[1] = (uint8_t)(FEE_SIZE >> 8U);
        rsp[2] = (uint8_t)(FEE_SIZE & 0xFFU);

        for (i = 0U; i < FEE_SIZE; i++)
        {
            rsp[3U + i] = g_FEE_Buffer[i];
        }
        rsp[3U + FEE_SIZE] = ETX;

        comms_send(rsp, sizeof(rsp));
    }
    else
    {
        /* 其他地址 → 仅发 ETX (与 Honcho 完全一致) */
        uint8_t etx = ETX;
        comms_send(&etx, 1U);
    }
}

/*
 * 'E' LOAD_EEPROM
 *
 * Bootloader 特有命令 (Honcho 未实现).
 * Receive: length high + length low + data + checksum high + checksum low + ETX
 * Response: 'E' + length high + length low + checksum high + checksum low + ETX
 *
 * Protected pages: first 16 bytes and last 16 bytes are protected
 */
static void cmd_load_eeprom(void)
{
    uint8_t  nh, nl;
    uint8_t  buf[FEE_SIZE];
    uint8_t  ch_rx, cl_rx;
    uint16_t n, i;
    uint16_t checksum;
    uint8_t  Protected_Page_Data[PROTECTED_PAGE_SIZE_0];

    if (recv_byte(&nh) != FSP_SUCCESS) { send_nak(); return; }
    if (recv_byte(&nl) != FSP_SUCCESS) { send_nak(); return; }
    n = (uint16_t)(((uint16_t)nh << 8U) | (uint16_t)nl);

    if (n == 0U || n > FEE_SIZE) { send_nak(); return; }

    /* Increment EEPROM buffer counter (for redundancy) */
    Increment_EEP_Buffer(3U, 1U);

    checksum = 0U;

    for (i = 0U; i < n; i++)
    {
        if (i < (PROTECTED_PAGE_START_0 + PROTECTED_PAGE_SIZE_0))
        {
            if (recv_byte(&Protected_Page_Data[i]) != FSP_SUCCESS) { send_nak(); return; }
            comms_send(&Protected_Page_Data[i], 1U);   /* echo byte immediately per spec */
            checksum += Protected_Page_Data[i];
        }
        else if (i < PROTECTED_PAGE_START_1)
        {
            if (recv_byte(&buf[i]) != FSP_SUCCESS) { send_nak(); return; }
            comms_send(&buf[i], 1U);                   /* echo byte immediately per spec */
            checksum += buf[i];
            g_FEE_Buffer[i] = buf[i];
        }
        else
        {
            if (recv_byte(&Protected_Page_Data[i - PROTECTED_PAGE_START_1]) != FSP_SUCCESS) { send_nak(); return; }
            comms_send(&Protected_Page_Data[i - PROTECTED_PAGE_START_1], 1U);  /* echo byte immediately per spec */
            checksum += Protected_Page_Data[i - PROTECTED_PAGE_START_1];
        }
    }

    if (recv_byte(&ch_rx) != FSP_SUCCESS) { send_nak(); return; }
    if (recv_byte(&cl_rx) != FSP_SUCCESS) { send_nak(); return; }

    if ((uint8_t)(checksum >> 8U) != ch_rx || (uint8_t)(checksum & 0xFFU) != cl_rx)
    {
        send_nak();
        return;
    }

    /* Write to EEPROM (Flash emulation) */
    FEE_Write();

    /* Send response */
    uint8_t rsp[6];
    rsp[0] = COMMAND_LOAD_EEPROM;
    rsp[1] = nh;
    rsp[2] = nl;
    rsp[3] = (uint8_t)(checksum >> 8U);
    rsp[4] = (uint8_t)(checksum & 0xFFU);
    rsp[5] = ETX;
    comms_send(rsp, sizeof(rsp));
}

/*
 * 'M' LOAD_FLASH
 *
 * Bootloader 特有命令 (Honcho 未实现).
 * Receive: length high + length low + data + checksum high + checksum low + ETX
 * Response: 'M' + 0x00 + 0x02 + checksum high + checksum low
 *
 * Auto-erase 2KB block when entering new block
 */
static void cmd_load_flash(void)
{
    uint8_t  nh, nl;
    uint8_t  buf[PAGE_SIZE];
    uint8_t  ch_rx, cl_rx;
    uint16_t n, i;
    uint16_t checksum;
    fsp_err_t err;

    if (recv_byte(&nh) != FSP_SUCCESS) { send_nak(); return; }
    if (recv_byte(&nl) != FSP_SUCCESS) { send_nak(); return; }
    n = (uint16_t)(((uint16_t)nh << 8U) | (uint16_t)nl);

    if (n == 0U || n > PAGE_SIZE) { send_nak(); return; }

    /* Receive data */
    for (i = 0U; i < n; i++)
    {
        if (recv_byte(&buf[i]) != FSP_SUCCESS) { send_nak(); return; }
    }

    /* Receive checksum */
    if (recv_byte(&ch_rx) != FSP_SUCCESS) { send_nak(); return; }
    if (recv_byte(&cl_rx) != FSP_SUCCESS) { send_nak(); return; }

    /* Verify checksum */
    checksum = checksum16(buf, n);
    if ((uint8_t)(checksum >> 8U) != ch_rx || (uint8_t)(checksum & 0xFFU) != cl_rx)
    {
        send_nak();
        return;
    }

    /* Validate address range */
    if (!addr_in_app_range(g_target_addr, n))
    {
        send_nak();
        return;
    }

    /* Erase 2KB block if entering new block */
    err = erase_block_if_needed(g_target_addr);
    if (err != FSP_SUCCESS) { send_nak(); return; }

    /* Write page to flash */
    ThreadsAndInterrupts(DISABLE);
    err = g_flash0.p_api->write(g_flash0.p_ctrl, (uint32_t)buf, g_target_addr, n);
    ThreadsAndInterrupts(RE_ENABLE);

    if (err != FSP_SUCCESS) { send_nak(); return; }

    g_target_addr += n;

    /* Send response */
    uint8_t rsp[6];
    rsp[0] = COMMAND_LOAD_FLASH;
    rsp[1] = 0x00U;
    rsp[2] = 0x02U;
    rsp[3] = (uint8_t)(checksum >> 8U);
    rsp[4] = (uint8_t)(checksum & 0xFFU);
    rsp[5] = ETX;
    comms_send(rsp, 6U);
}


/*
 * '*' CHANGE_BAUD — Bootloader 格式
 *
 * 回显 '*' 后切换到高速波特率, 保持高速等待后续 SET_ADDRESS + LOAD_FLASH.
 * LOAD_FLASH/LOAD_EEPROM 完成后自行切回慢速.
 */
static void cmd_change_baud(void)
{
    uint8_t rsp = COMMAND_CHANGE_BAUD;
    comms_send(&rsp, 1U);

    /* Switch to fast baud rate (28800) */
    fsp_err_t err = comms_set_baud(UART_BAUD_FAST);
    if (err != FSP_SUCCESS)
    {
        send_nak();
    }
}


/* ================================================================== */
/*  Boot attempt                                                        */
/* ================================================================== */
static void try_boot(void)
{
    struct boot_rsp rsp;
    uint32_t flag       = *(uint32_t *)OTA_FLAG_END_ADDRESS;
    uint16_t crc_flash  = calcrc(APP_IMAGE_START_ADDRESS,
                                 (int)(CRC_ADDRESS - APP_IMAGE_START_ADDRESS));
    uint16_t crc_stored = (uint16_t)(*(uint32_t *)CRC_ADDRESS);

    /* Build debug string without snprintf:
     * "[BL] flag=0x???????? crc_f=0x???? crc_s=0x????\r\n"  (48 bytes max) */
    uint8_t dbg[56];
    uint8_t *p = dbg;
    p = put_str(p, "[BL] flag=0x");
    p = put_hex32(p, flag);
    p = put_str(p, " crc_f=0x");
    p = put_hex16(p, crc_flash);
    p = put_str(p, " crc_s=0x");
    p = put_hex16(p, crc_stored);
    p = put_str(p, "\r\n");
    comms_send(dbg, (uint32_t)(p - dbg));

